InformationRegisters/ЭАрМ_ОжидаемыеПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭАрМ_ОжидаемыеПодтвержденияЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЭАрМ_СтатусыОжиданияПодтвержденияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПовторнойОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработаноВДалион</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЭАрМ_ОбработкаПодтвержденийЭДО/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// >>> НАЧАЛО — Точка входа для регламентного задания <<<
// Вызывать эту процедуру из регламентного задания.
//
Процедура ЭАрМ_Вызов() Экспорт
	ПовторитьНеудачныеОтправки();
	ПроверитьПапкуОбмена();
	ОбработатьВходящиеЭТрНИзРегистра();
КонецПроцедуры
// >>> КОНЕЦ — Точка входа <<<

// Отправляет входящий ЭДО-документ на подтверждение в другую базу.
//
Процедура ОтправитьНаПодтверждение(ЭлектронныйДокумент) Экспорт

	// Проверка заполненности обязательных реквизитов
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"Организация, Контрагент, ДатаАннулирования, ВидДокумента");

	Если НЕ ЗначениеЗаполнено(Реквизиты.Организация)
		ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ОтправитьНаПодтверждение'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , ЭлектронныйДокумент,
			НСтр("ru = 'Не заполнены обязательные реквизиты (Организация или Контрагент)'"));
		Возврат;
	КонецЕсли;

	// Проверка: документ не аннулирован
	Если ЗначениеЗаполнено(Реквизиты.ДатаАннулирования) Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ОтправитьНаПодтверждение'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , ЭлектронныйДокумент,
			НСтр("ru = 'Документ аннулирован, отправка на подтверждение невозможна'"));
		Возврат;
	КонецЕсли;

	// Проверка для ЭТрН: наличие связанного документа
	ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Реквизиты.ВидДокумента, "ТипДокумента");
	Если ТипДокумента = Перечисления.ТипыДокументовЭДО.ЭТрН Тогда
		Если НЕ СвязанныйЭТрННайден(ЭлектронныйДокумент) Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'АРМ_ЭдоОбмен.ОтправитьНаПодтверждение'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, , ЭлектронныйДокумент,
				НСтр("ru = 'Не найден документ ЭлектроннаяТранспортнаяНакладная'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Попытка
		ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);

		ЗаписатьСтатусОжидания(ЭлектронныйДокумент, ИдентификаторЗапроса,
			Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает);

		Успешно = ЭАрМ_ОбменСДругойБазой.ОтправитьДокументНаПодтверждение(
			ЭлектронныйДокумент, ИдентификаторЗапроса);

		Если НЕ Успешно Тогда
			ЗаписатьСтатусОжидания(ЭлектронныйДокумент, ИдентификаторЗапроса,
				Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Отклонено,
				НСтр("ru = 'Ошибка отправки в другую базу'"));
		КонецЕсли;

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ОтправитьНаПодтверждение'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ЭлектронныйДокумент,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Обрабатывает ответ-подтверждение от другой базы.
//
Процедура ОбработатьОтветПодтверждения(ИдентификаторЗапроса, Подтверждено, Комментарий = "") Экспорт

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.ЭлектронныйДокумент КАК ЭлектронныйДокумент
		|ИЗ
		|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
		|ГДЕ
		|	Т.ИдентификаторЗапроса = &ИдентификаторЗапроса
		|	И Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает)";
		Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса);

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'АРМ_ЭдоОбмен.ОбработатьОтветПодтверждения'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, , ,
				СтрШаблон(НСтр("ru = 'Не найдена запись ожидания для идентификатора %1'"),
					ИдентификаторЗапроса));
			Возврат;
		КонецЕсли;

		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЭлектронныйДокумент = Выборка.ЭлектронныйДокумент;

		НовыйСтатус = ?(Подтверждено,
			Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Подтверждено,
			Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Отклонено);

		ЗаписатьСтатусОжидания(ЭлектронныйДокумент, ИдентификаторЗапроса,
			НовыйСтатус, Комментарий);

		// Подписание и отправка только для ЭДО-документов
		Если Подтверждено Тогда
			Попытка
				ПодписатьИОтправитьПослеПодтверждения(ЭлектронныйДокумент);
			Исключение
				// Для не-ЭДО документов (ЗаказКлиента и т.п.) — подписание не требуется
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'АРМ_ЭдоОбмен.ОбработатьОтветПодтверждения'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Информация, , ЭлектронныйДокумент,
					НСтр("ru = 'Документ не является ЭДО, подписание пропущено'"));
			КонецПопытки;
		КонецЕсли;

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ОбработатьОтветПодтверждения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Запускает утверждение, подписание и отправку электронного документа.
//
Процедура ПодписатьИОтправитьПослеПодтверждения(ЭлектронныйДокумент) Экспорт

	Попытка
		НаборДействий = ЭлектронныеДокументыЭДОКлиентСервер.НовыйНаборДействийПоЭДО();
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.Утвердить);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.Подписать);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий,
			Перечисления.ДействияПоЭДО.Отправить);

		ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
		ПараметрыВыполнения.НаборДействий = НаборДействий;
		ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы.Добавить(ЭлектронныйДокумент);

		ЭлектронныеДокументыЭДО.ВыполнитьДействияПоИнтеграциямЭДО(ПараметрыВыполнения);

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ПодписаниеИОтправка'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ЭлектронныйДокумент,
			НСтр("ru = 'Документ утвержден, подписан и отправлен'"));

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ПодписаниеИОтправка'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ЭлектронныйДокумент,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Записывает статус ожидания подтверждения в регистр сведений.
//
Процедура ЗаписатьСтатусОжидания(ЭлектронныйДокумент, ИдентификаторЗапроса, Статус, Комментарий = "") Экспорт

	Попытка
		МенеджерЗаписи = РегистрыСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
		МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса;
		МенеджерЗаписи.Статус = Статус;
		МенеджерЗаписи.Комментарий = Комментарий;

		Если Статус = Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает Тогда
			МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса();
		Иначе
			МенеджерЗаписи.ДатаОтвета = ТекущаяДатаСеанса();
		КонецЕсли;

		МенеджерЗаписи.Записать(Истина);

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ЗаписатьСтатусОжидания'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ЭлектронныйДокумент,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Получает текущий статус документа из регистра.
//
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьТекущийСтатус(ЭлектронныйДокумент) Экспорт

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
		|ГДЕ
		|	Т.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Т.ДатаОтправки УБЫВ";
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;

		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Статус;

	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'АРМ_ЭдоОбмен.ПолучитьТекущийСтатус'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ЭлектронныйДокумент,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Точка входа для регламентного задания проверки папки обмена.
//
Процедура ПроверитьПапкуОбмена() Экспорт

	ПутьКПапке = ЭАрМ_НастройкиСервер.ПолучитьНастройку("ПапкаОбмена");
	Если НЕ ЗначениеЗаполнено(ПутьКПапке) Тогда
		Возврат;
	КонецЕсли;

	Каталог = Новый Файл(ПутьКПапке);
	Если НЕ Каталог.Существует() Тогда
		Возврат;
	КонецЕсли;

	НайденныеФайлы = НайтиФайлы(ПутьКПапке, "response_*.json");
	Для Каждого Файл Из НайденныеФайлы Цикл
		Попытка
			ЧтениеТекста = Новый ЧтениеТекста(Файл.ПолноеИмя, КодировкаТекста.UTF8);
			Содержимое = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();

			// Убираем BOM если есть
			Если Лев(Содержимое, 1) = Символ(65279) Тогда
				Содержимое = Сред(Содержимое, 2);
			КонецЕсли;

			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СокрЛП(Содержимое));
			Данные = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Если Данные.Свойство("requestId") И Данные.Свойство("approved") Тогда
				ОбработатьОтветПодтверждения(
					Данные.requestId,
					Данные.approved,
					?(Данные.Свойство("comment"), Данные.comment, ""));

				АрхивПуть = ПутьКПапке + "\archive";
				АрхивКаталог = Новый Файл(АрхивПуть);
				Если НЕ АрхивКаталог.Существует() Тогда
					СоздатьКаталог(АрхивПуть);
				КонецЕсли;
				ПереместитьФайл(Файл.ПолноеИмя, АрхивПуть + "\" + Файл.Имя);
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("АРМ_ЭДО.ПроверкаПапки",
				УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Проверяет наличие связанного документа ЭлектроннаяТранспортнаяНакладная.
//
Функция СвязанныйЭТрННайден(ЭлектронныйДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК Связи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяТранспортнаяНакладная КАК ЭТрН
	|		ПО Связи.ОбъектУчета = ЭТрН.Ссылка
	|ГДЕ
	|	Связи.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Повторяет неудачные отправки в Далион.
//
Процедура ПовторитьНеудачныеОтправки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса
	|ИЗ
	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|	Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.ОшибкаОтправки)";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ЗаписьЖурналаРегистрации("АРМ_ЭДО.ПовторОтправки",
			УровеньЖурналаРегистрации.Информация, , Выборка.ЭлектронныйДокумент,
			СтрШаблон("Повтор отправки, requestId=%1", Выборка.ИдентификаторЗапроса));

		Успешно = ЭАрМ_ОбменСДругойБазой.ОтправитьДокументНаПодтверждение(
			Выборка.ЭлектронныйДокумент, Выборка.ИдентификаторЗапроса);

		Если Успешно Тогда
			ЗаписатьСтатусОжидания(Выборка.ЭлектронныйДокумент, Выборка.ИдентификаторЗапроса,
				Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает,
				"Повторная отправка успешна");
		Иначе
			ЗаписатьСтатусОжидания(Выборка.ЭлектронныйДокумент, Выборка.ИдентификаторЗапроса,
				Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.ОжидаетПовторнойОтправки,
				"Повтор не удался");
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Сверяет статусы с базой Далион.
//
Процедура СверитьСДалион() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
	|	Т.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	|	Т.ДатаОтправки КАК ДатаОтправки
	|ИЗ
	|	РегистрСведений.ЭАрМ_ОжидаемыеПодтвержденияЭДО КАК Т
	|ГДЕ
	|	Т.Статус = ЗНАЧЕНИЕ(Перечисление.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.Ожидает)
	|	И РАЗНОСТЬДАТ(Т.ДатаОтправки, &ТекущаяДата, ЧАС) > 1";

	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		СтатусВДалион = ЭАрМ_ОбменСДругойБазой.ПроверитьСтатусВДалион(Выборка.ИдентификаторЗапроса);

		Если СтатусВДалион = Неопределено Тогда
			ЗаписатьСтатусОжидания(Выборка.ЭлектронныйДокумент, Выборка.ИдентификаторЗапроса,
				Перечисления.ЭАрМ_СтатусыОжиданияПодтвержденияЭДО.НеОбработаноВДалион,
				"Далион не ответил");
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// ============================================================================
// ОБРАБОТКА ВХОДЯЩИХ ЭТРН ИЗ РЕГИСТРА АРМ_ВходящиеЭТрН
// ============================================================================

// Читает записи из РС АРМ_ВходящиеЭТрН со статусом "Новый"
// и передаёт их в базу ДАЛИОН через FTP.
//
Процедура ОбработатьВходящиеЭТрНИзРегистра() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	Т.ДатаПолучения КАК ДатаПолучения,
	|	Т.ТипДокумента КАК ТипДокумента,
	|	Т.ДанныеДокумента КАК ДанныеДокумента
	|ИЗ
	|	РегистрСведений.АРМ_ВходящиеЭТрН КАК Т
	|ГДЕ
	|	Т.Статус = ""Новый""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаПолучения";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл

		Попытка
			// Парсим JSON из регистра
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Выборка.ДанныеДокумента);
			ДанныеДокумента = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			// Добавляем идентификатор для отслеживания
			ДанныеДокумента.Вставить("ИдентификаторЗапроса", Выборка.ИдентификаторДокумента);

			// Передаём в ДАЛИОН через HTTP-сервис расширения
			РезультатПриёма = ЭАрМ_ПриемДокументовДалион.ПринятьДокументЧерезHTTP(ДанныеДокумента);

			// Обновляем статус в РС
			МенеджерЗаписи = РегистрыСведений.АРМ_ВходящиеЭТрН.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИдентификаторДокумента = Выборка.ИдентификаторДокумента;
			МенеджерЗаписи.Прочитать();

			Если МенеджерЗаписи.Выбран() Тогда
				Если РезультатПриёма.Принято Тогда
					МенеджерЗаписи.Статус = "Обработан";
				Иначе
					МенеджерЗаписи.Статус = "Ошибка";
				КонецЕсли;
				МенеджерЗаписи.Комментарий = РезультатПриёма.Комментарий;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;

			ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОбработатьЭТрН",
				УровеньЖурналаРегистрации.Информация, , ,
				СтрШаблон("ЭТрН %1: %2 — %3",
					Выборка.ИдентификаторДокумента,
					?(РезультатПриёма.Принято, "OK", "Ошибка"),
					РезультатПриёма.Комментарий));

		Исключение
			// При ошибке — помечаем как "Ошибка" в РС
			Попытка
				МенеджерЗаписи = РегистрыСведений.АРМ_ВходящиеЭТрН.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ИдентификаторДокумента = Выборка.ИдентификаторДокумента;
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.Статус = "Ошибка";
					МенеджерЗаписи.Комментарий = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
					МенеджерЗаписи.Записать(Истина);
				КонецЕсли;
			Исключение
			КонецПопытки;

			ЗаписьЖурналаРегистрации("АРМ_ЭДО.ОбработатьЭТрН",
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("Ошибка обработки %1: %2",
					Выборка.ИдентификаторДокумента,
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
